export const initialCards = [{
    header: 'Ужесточить нормы выбросов углекислого газа для новых автомобилей до 95 г/км',
    poem: 
`Не мысля гордый свет забавить,
Вниманье дружбы возлюбя,
Хотел бы я тебе представить
Залог достойнее тебя,
Достойнее души прекрасной,
Святой исполненной мечты,
Поэзии живой и ясной,
Высоких дум и простоты;
Но так и быть — рукой пристрастной
Прими собранье пестрых глав,
Полусмешных, полупечальных,
Простонародных, идеальных,
Небрежный плод моих забав,
Бессонниц, легких вдохновений,
Незрелых и увядших лет,
Ума холодных наблюдений
И сердца горестных замет.`,
    dataTag: 'welfare',
    votes: '2514'
    },

    {
    header: 'Ужесточить нормы выбросов углекислого газа для новых автомобилей до 95 г/км',
    poem: 
`Не мысля гордый свет забавить,
Вниманье дружбы возлюбя,
Хотел бы я тебе представить
Залог достойнее тебя,
Достойнее души прекрасной,
Святой исполненной мечты,
Поэзии живой и ясной,
Высоких дум и простоты;
Но так и быть — рукой пристрастной
Прими собранье пестрых глав,
Полусмешных, полупечальных,
Простонародных, идеальных,
Небрежный плод моих забав,
Бессонниц, легких вдохновений,
Незрелых и увядших лет,
Ума холодных наблюдений
И сердца горестных замет.`,
    dataTag: 'plastic',
    votes: '754'
    },

    {
    header: 'Ужесточить нормы выбросов углекислого газа для новых автомобилей до 95 г/км',
    poem: 
`Не мысля гордый свет забавить,
Вниманье дружбы возлюбя,
Хотел бы я тебе представить
Залог достойнее тебя,
Достойнее души прекрасной,
Святой исполненной мечты,
Поэзии живой и ясной,
Высоких дум и простоты;
Но так и быть — рукой пристрастной
Прими собранье пестрых глав,
Полусмешных, полупечальных,
Простонародных, идеальных,
Небрежный плод моих забав,
Бессонниц, легких вдохновений,
Незрелых и увядших лет,
Ума холодных наблюдений
И сердца горестных замет.`,
    dataTag: 'garbage',
    votes: '648'
    },

    {
    header: 'Ужесточить нормы выбросов углекислого газа для новых автомобилей до 95 г/км',
    poem: 
`Не мысля гордый свет забавить,
Вниманье дружбы возлюбя,
Хотел бы я тебе представить
Залог достойнее тебя,
Достойнее души прекрасной,
Святой исполненной мечты,
Поэзии живой и ясной,
Высоких дум и простоты;
Но так и быть — рукой пристрастной
Прими собранье пестрых глав,
Полусмешных, полупечальных,
Простонародных, идеальных,
Небрежный плод моих забав,
Бессонниц, легких вдохновений,
Незрелых и увядших лет,
Ума холодных наблюдений
И сердца горестных замет.`,
    dataTag: 'animals',
    votes: '325'
    },

    {
    header: 'Ужесточить нормы выбросов углекислого газа для новых автомобилей до 95 г/км',
    poem: 
`Не мысля гордый свет забавить,
Вниманье дружбы возлюбя,
Хотел бы я тебе представить
Залог достойнее тебя,
Достойнее души прекрасной,
Святой исполненной мечты,
Поэзии живой и ясной,
Высоких дум и простоты;
Но так и быть — рукой пристрастной
Прими собранье пестрых глав,
Полусмешных, полупечальных,
Простонародных, идеальных,
Небрежный плод моих забав,
Бессонниц, легких вдохновений,
Незрелых и увядших лет,
Ума холодных наблюдений
И сердца горестных замет.
Не мысля гордый свет забавить,
Вниманье дружбы возлюбя,
Хотел бы я тебе представить
Залог достойнее тебя,
Достойнее души прекрасной,
Святой исполненной мечты,
Поэзии живой и ясной,
Высоких дум и простоты;
Но так и быть — рукой пристрастной
Прими собранье пестрых глав,
Полусмешных, полупечальных,
Простонародных, идеальных,
Небрежный плод моих забав,
Бессонниц, легких вдохновений,
Незрелых и увядших лет,
Ума холодных наблюдений
И сердца горестных замет.`,
    dataTag: 'smoke',
    votes: '9343'
    },

    {
    header: 'Ужесточить нормы выбросов углекислого газа для новых автомобилей до 95 г/км',
    poem:
`Не мысля гордый свет забавить,
Вниманье дружбы возлюбя,
Хотел бы я тебе представить
Залог достойнее тебя,
Достойнее души прекрасной,
Святой исполненной мечты,
Поэзии живой и ясной,
Высоких дум и простоты;
Но так и быть — рукой пристрастной
Прими собранье пестрых глав,
Полусмешных, полупечальных,
Простонародных, идеальных,
Небрежный плод моих забав,
Бессонниц, легких вдохновений,
Незрелых и увядших лет,
Ума холодных наблюдений
И сердца горестных замет.`,
    dataTag: 'welfare',
    votes: '8100'
    }
];

export const aboutLink = document.getElementById('about');
export const hintButton = document.querySelector('.add-initiative__show-hint');
export const searchPoem = document.getElementById('searchPoem');
export const refreshList = document.getElementById('refreshList');
export const inputPoem = document.getElementById('inputPoem');
export const poemList = document.getElementById('poemList');
export const errorMessage = document.querySelector('.poem__default-item');
export const poemTextarea = document.getElementById('poemTextarea');
export const categories = document.getElementById('categories');
export const cardsList = document.querySelector('.cards');
export const userElement = document.querySelector('.header__userpic');
export const userMenu = document.querySelector('.header__menu');
